/* -*-C-*-

$Header: /Users/cph/tmp/foo/mit-scheme/mit-scheme/v7/src/microcode/Attic/doskbd.c,v 1.6 1992/05/28 19:08:24 jinx Exp $

Copyright (c) 1992 Massachusetts Institute of Technology

This material was developed by the Scheme project at the Massachusetts
Institute of Technology, Department of Electrical Engineering and
Computer Science.  Permission to copy this software, to redistribute
it, and to use it for any purpose is granted, subject to the following
restrictions and understandings.

1. Any copy made of this software must include this copyright notice
in full.

2. Users of this software agree to make their best efforts (a) to
return to the MIT Scheme project any improvements or extensions that
they make, so that these may be included in future releases; and (b)
to inform MIT of noteworthy uses of this software.

3. All materials developed as a consequence of the use of this
software shall duly acknowledge such use, in accordance with the usual
standards of acknowledging credit in academic research.

4. MIT has made no warrantee or representation that the operation of
this software will be error-free, and MIT is under no obligation to
provide any services, by way of maintenance, update, or otherwise.

5. In conjunction with products arising from the use of this material,
there shall be no use of the name of the Massachusetts Institute of
Technology nor of any adaptation thereof in any advertising,
promotional, or sales literature without prior written consent from
MIT in each case. */

/* These flags determine how the code will behave. */

#define DOSX_USE_INT_INTERCEPT
#define DOSX_RM_HANDLER_UNTOUCHED
#define DOSX_PM_HANDLER_UNTOUCHED
/* #define DOSX_RM_HANDLER_REAL */
#define DPMI_RM_HANDLER_REAL
#define DPMI_PM_HANDLER_UNTOUCHED

#include <stdlib.h>
#include <stdio.h>
#include <errno.h>
#include <bios.h>
#include <dos.h>
#include <int.h>
#include "msdos.h"

#ifdef getDS
#undef getDS
#endif

#include "dossys.h"
#include "dosinsn.h"
#include "doskbd.h"

#ifndef ELOOP
#  define ELOOP 2000
#endif

#ifndef EFAULT
#  define EFAULT 2001
#endif

/* Tables mapping scan codes to ASCII characters.
   Entries with NULL (\0) should not be mapped by the
   Scheme keyboard ISR.  Let the default handler map them.
 */

static unsigned char
shifted_scan_code_to_ascii[] =
{ 
	'\0',		/* 0 */
	'\033',		/* 1 */
	'!',		/* 2 */
	'@',		/* 3 */
	'#',		/* 4 */
	'$',		/* 5 */
	'%',		/* 6 */
	'^',		/* 7 */
	'&',		/* 8 */
	'*',		/* 9 */
	'(',		/* 10 */
	')',		/* 11 */
	'_',		/* 12 */
	'+',		/* 13 */
	'\177',		/* 14 */
	'\t',		/* 15 */
	'Q',		/* 16 */
	'W',		/* 17 */
	'E',		/* 18 */
	'R',		/* 19 */
	'T',		/* 20 */
	'Y',		/* 21 */
	'U',		/* 22 */
	'I',		/* 23 */
	'O',		/* 24 */
	'P',		/* 25 */
	'{',		/* 26 */
	'}',		/* 27 */
	'\r',		/* 28 */
	'\0',		/* 29 */
	'A',		/* 30 */
	'S',		/* 31 */
	'D',		/* 32 */
	'F',		/* 33 */
	'G',		/* 34 */
	'H',		/* 35 */
	'J',		/* 36 */
	'K',		/* 37 */
	'L',		/* 38 */
	':',		/* 39 */
	'\"',		/* 40 */
	'~',		/* 41 */
	'\0',		/* 42 */
	'|',		/* 43 */
	'Z',		/* 44 */
	'X',		/* 45 */
	'C',		/* 46 */
	'V',		/* 47 */
	'B',		/* 48 */
	'N',		/* 49 */
	'M',		/* 50 */
	'<',		/* 51 */
	'>',		/* 52 */
	'?',		/* 53 */
	'\0',		/* 54 */
	'\0',		/* 55 */
	'\0',		/* 56 */
	' '		/* 57 */
  };
    
static unsigned char
unshifted_scan_code_to_ascii[] =
{
	'\0',		/* 0 */
	'\033',		/* 1 */
	'1',		/* 2 */
	'2',		/* 3 */
	'3',		/* 4 */
	'4',		/* 5 */
	'5',		/* 6 */
	'6',		/* 7 */
	'7',		/* 8 */
	'8',		/* 9 */
	'9',		/* 10 */
	'0',		/* 11 */
	'-',		/* 12 */
	'=',		/* 13 */
	'\177',		/* 14 */
	'\t',		/* 15 */
	'q',		/* 16 */
	'w',		/* 17 */
	'e',		/* 18 */
	'r',		/* 19 */
	't',		/* 20 */
	'y',		/* 21 */
	'u',		/* 22 */
	'i',		/* 23 */
	'o',		/* 24 */
	'p',		/* 25 */
	'[',		/* 26 */
	']',		/* 27 */
	'\r',		/* 28 */
	'\0',		/* 29 */
	'a',		/* 30 */
	's',		/* 31 */
	'd',		/* 32 */
	'f',		/* 33 */
	'g',		/* 34 */
	'h',		/* 35 */
	'j',		/* 36 */
	'k',		/* 37 */
	'l',		/* 38 */
	';',		/* 39 */
	'\'',		/* 40 */
	'`',		/* 41 */
	'\0',		/* 42 */
	'\\',		/* 43 */
	'z',		/* 44 */
	'x',		/* 45 */
	'c',		/* 46 */
	'v',		/* 47 */
	'b',		/* 48 */
	'n',		/* 49 */
	'm',		/* 50 */
	',',		/* 51 */
	'.',		/* 52 */
	'/',		/* 53 */
	'\0',		/* 54 */
	'\0',		/* 55 */
	'\0',		/* 56 */
	' '		/* 57 */
  };

static unsigned char modifier_mask = 0x4f;

union RM_address
{
  unsigned fp;
  struct
    {
      unsigned short off;
      unsigned short seg;
    } x;
};

dos_boolean
under_QEMM_386_p (void)
{
  unsigned int i;
  union REGS iregs, oregs;

  iregs.h.al = 0x01;
  iregs.x.bx = 0x5145;
  iregs.x.cx = 0x4d4d;
  iregs.x.dx = 0x3432;

  for (i = 0xc0; i <= 0xff; i++)
  {
    iregs.h.ah = i;
    int86 (0x2f, &iregs, &oregs);
    if (oregs.x.bx == 0x4f4b)
      return (dos_true);
  }
  return (dos_false);
}

dos_boolean
under_DPMI_p (void)
{
  union REGS regs;
  
  regs.e.eax = 0x1686;
  int86 (0x2f, &regs, &regs);
  return (regs.x.ax == 0);
}

static void
normalize_RM_address (union RM_address * addr)
{
  if (addr->x.off > 0xf)
  {
    addr->x.seg += (addr->x.off >> 4);
    addr->x.off = (addr->x.off & 0xf);
  }
  return;
}

static dos_boolean
install_kbd_hook_p (char * var_name)
{
  extern int strcmp_ci (char *, char *);
  char * envvar = (DOS_getenv (var_name));

  if ((envvar != NULL) && ((strcmp_ci (envvar, "false")) == 0))
    return (dos_false);
  else
    return (dos_true);
}

/*
   We would like to use Zortech's int_intercept with the following
   routine under DOSX (or Phar Lap).

   Unfortunately, it does not work under QEMM386 or under MS Windows 3.1.
   The real-mode call-back routine is apparently just plain broken.

   In addition, bypassing DOSX under DPMI 0.9 and using DPMI's
   real-mode call backs does not work consistently, and the keyboard
   interrupt happens only in real mode since we are capturing the
   interrupt DOS uses to tell the BIOS that a scan code has arrived
   after doing the handshake with the keyboard device itself.

   Thus, under DPMI, we install our own hard-coded real-mode keyboard
   driver and don't bother with a protected mode handler.  All the
   code is here in case it can be turned on in the future, perhaps for
   a different DOS Extender or a new version of DPMI.

   Apparently telling DOSX to install a protected mode handler and
   making it reflect real mode interrupts to protected mode does not
   work consistently under QEMM386 either, thus we are now installing
   a real-mode handler no matter what, although using different
   mechanisms under DPMI and not DPMI.
 */

#ifdef DOSX_USE_INT_INTERCEPT

#define PC_KBD_ALT_MASK			0x8
#define PC_KBD_CTRL_MASK		0x4
#define PC_KBD_SHIFT_MASK		0x3
#define PC_KBD_CAPSL_MASK		0x40

#define DOS_HOOK_TRANSLATE_KEYSTROKE	0x4f
#define DOS_KBD_FUNC_RECORD_KEYSTROKE	0x5

int
bios_keyboard_handler(struct INT_DATA *pd)
{
  unsigned char scan_code, chord, ascii;
  union REGS regs;

  if (pd->regs.h.ah != DOS_HOOK_TRANSLATE_KEYSTROKE)
    return (INTERRUPT_CHAIN_NEXT);

  scan_code = (pd->regs.h.al);
  if (scan_code >= (sizeof (shifted_scan_code_to_ascii)))
    return (INTERRUPT_CHAIN_NEXT);

  chord = ((bioskey (_KEYBRD_SHIFTSTATUS)) & modifier_mask);

  if ((chord == 0) || (chord == PC_KBD_ALT_MASK))
    ascii = ((int) unshifted_scan_code_to_ascii[scan_code]);
  else
    ascii = ((int) shifted_scan_code_to_ascii[scan_code]);

  if (ascii == 0)
    return (INTERRUPT_CHAIN_NEXT);
  if ((chord & PC_KBD_CTRL_MASK) != 0)
    ascii &= ~0x60;			/* Controlify */
  if (chord & PC_KBD_ALT_MASK)
    ascii |= 0x80;			/* Metafy */
  if (ascii == 0360)
    return (INTERRUPT_CHAIN_NEXT);	/* Problems with M-p */
  if ((ascii == 0200) || (ascii == 0))
    scan_code = 3;			/* Problems with C-Space */

  /* Insert metafied char in bios buffer. */
  regs.h.ah = DOS_KBD_FUNC_RECORD_KEYSTROKE;
  regs.h.ch = scan_code;
  regs.h.cl = ascii;
  int86 (DOS_INTVECT_KEYBOARD_REQUEST, &regs, &regs);

  pd->regs.e.flags &= ~1;		/* clear CF, scan code ignored! */
  return (INTERRUPT_RETURN);
}
#endif /* DOSX_USE_INT_INTERCEPT */

static void
DPMI_PM_getvector (unsigned vecnum, unsigned * eip, unsigned * cs)
{
  union REGS regs;
  
  regs.x.ax = 0x204;
  regs.h.bl = (vecnum & 0xff);
  int86 (0x31, &regs, &regs);
  * eip = regs.e.edx;
  * cs = ((unsigned) regs.x.cx);
  return;
}

static int
DPMI_PM_setvector (unsigned vecnum, unsigned eip, unsigned cs)
{
  union REGS regs;
  
  regs.x.ax = 0x205;
  regs.h.bl = (vecnum & 0xff);
  regs.e.edx = eip;
  regs.x.cx = ((unsigned short) cs);
  int86 (0x31, &regs, &regs);
  return (((regs.e.flags & 1) == 0) ? DOS_SUCCESS : DOS_FAILURE);
}

static void
DPMI_RM_getvector (unsigned vecnum, unsigned short * ip, unsigned short * cs)
{
  union REGS regs;
  
  regs.x.ax = 0x200;
  regs.h.bl = (vecnum & 0xff);
  int86 (0x31, &regs, &regs);
  * ip = regs.x.dx;
  * cs = regs.x.cx;
  return;
}

static int
DPMI_RM_setvector (unsigned vecnum, unsigned short ip, unsigned short cs)
{
  union REGS regs;
  
  regs.x.ax = 0x201;
  regs.h.bl = (vecnum & 0xff);
  regs.x.cx = cs;
  regs.x.dx = ip;
  int86 (0x31, &regs, &regs);
  return (((regs.e.flags & 1) == 0) ? DOS_SUCCESS : DOS_FAILURE);
}

#ifdef DPMI_RM_HANDLER_PROTECTED

struct DPMI_RM_REGS
{
  unsigned long edi;		/* 0 */
  unsigned long esi;		/* 4 */
  unsigned long ebp;		/* 8 */
  unsigned long esp;		/* 12 */
  unsigned long ebx;		/* 16 */
  unsigned long edx;		/* 20 */
  unsigned long ecx;		/* 24 */
  unsigned long eax;		/* 28 */
  unsigned short flags;		/* 30 */
  unsigned short es;		/* 32 */
  unsigned short ds;		/* 34 */
  unsigned short fs;		/* 36 */
  unsigned short gs;		/* 38 */
  unsigned short ip;		/* 40 */
  unsigned short cs;		/* 42 */
  unsigned short sp;		/* 44 */
  unsigned short ss;		/* 48 */
  unsigned short pad;		/* 50 */
  unsigned long old_vector_ip;	/* 52 */
  unsigned long old_vector_cs;	/* 56 */
};

static int
DPMI_allocate_RM_call_back (unsigned short * cb_ip,
			    unsigned short * cb_cs,
			    unsigned eip, unsigned cs,
			    unsigned RM_regs, unsigned ds)
{
  union REGS regs;
  struct SREGS sregs;
  
  segread (& sregs);
  regs.x.ax = 0x303;
  regs.e.esi = eip;
  sregs.ds = cs;
  regs.e.edi = RM_regs;
  sregs.es = ds;

  int86x (0x31, &regs, &regs, &sregs);
  * cb_ip = regs.x.dx;
  * cb_cs = regs.x.cx;
  return (((regs.e.flags & 1) == 0) ? DOS_SUCCESS : DOS_FAILURE);
}

static int
DPMI_free_RM_call_back (unsigned short cb_ip, unsigned short cb_cs)
{
  union REGS regs;
  
  regs.x.ax = 0x304;
  regs.x.cx = cb_cs;
  regs.x.dx = cb_ip;
  int86 (0x31, &regs, &regs);
  return (((regs.e.flags & 1) == 0) ? DOS_SUCCESS : DOS_FAILURE);
}

#endif /* DPMI_RM_HANDLER_PROTECTED */

#ifdef DPMI_RM_HANDLER_REAL

static int
DPMI_allocate_DOS_block (unsigned short size,
			 unsigned short * rm_seg,
			 unsigned short * pm_sel)
{
